import React from 'react';
import styles from './index.less';

const Protocol: React.FC<{}> = () => {
  return (
    <div className={styles.protocol}>
      <h1>星空用户协议</h1>
      <p>更新日期：2021年9月1日</p>
      <h2>一、 关于“账号”</h2>
      <p>
        1.“星空”及相关服务为您提供了注册通道，你有权选择合法的字符组合作为自己的账号，并自行设置符合安全要求的密码。用户设置的账号、密码是用户用以登录并使用“星空”及相关服务的凭证。
      </p>
      <p>
        2.您理解并承诺，您所设置的账号不得违反国家法律法规及博主的相关规则，您的账号名称、头像和简介等注册信息及其他个人信息中不得出现违法和不良信息，未经他人许可不得用他人名义（包括但不限于冒用他人姓名、名称、字号、头像等足以让人引起混淆的方式）开设账号，不得恶意注册“星空”账号（包括但不限于频繁注册、批量注册账号等行为）。您在账号注册及使用过程中需遵守相关法律法规，不得实施任何侵害国家利益、损害其他公民合法权益，有害社会道德风尚的行为。博主有权对您提交的信息进行审核。
      </p>
      <p>
        3.您的账号仅限于您本人使用，未经博主书面同意，禁止以任何形式赠与、借用、出租、转让、售卖或以其他方式许可他人使用该账号。如果博主发现或者有合理理由认为使用者并非账号初始注册人，为保障账号安全，博主有权立即暂停或终止向该注册账号提供服务，或注销该账号。
      </p>
      <p>
        4.您有责任维护个人账号、密码的安全性与保密性，并对您以注册账号名义所从事的活动承担全部法律责任，包括但不限于您在“星空”及相关服务上进行的任何数据修改、言论发表、款项支付等操作行为可能引起的一切法律责任。您应高度重视对账号与密码的保密，在任何情况下不向他人透露账号及密码。若发现他人未经许可使用您的账号或发生其他任何安全漏洞问题时，您应当立即通知博主。
      </p>
      <p>
        5.在丢失账号或遗忘密码时，您可遵照博主的申诉途径及时申诉请求找回账号或密码。您理解并认可，博主的密码找回机制仅需要识别申诉单上所填资料与系统记录资料具有一致性，而无法识别申诉人是否系真正账号有权使用者。博主特别提醒您应妥善保管您的账号和密码。当您使用完毕后，应安全退出。如因您保管不当等自身原因或其他不可抗因素导致遭受盗号或密码丢失，您将自行承担相应责任。
      </p>
      <p>
        6.在注册、使用和管理账号时，您应保证注册账号时填写的身份信息的真实性，请您在注册、管理账号时使用真实、准确、合法、有效的相关身份证明材料及必要信息。依照国家相关法律法规的规定，为使用“星空”及相关服务的部分功能，您需要填写真实的身份信息，请您按照相关法律规定完成实名认证，并注意及时更新上述相关信息。若您提交的材料或提供的信息不准确、不真实、不合法或者博主有理由怀疑为错误、不实或不合法的资料，则博主有权拒绝为您提供相关功能，您可能无法使用“星空”及相关服务或在使用过程中部分功能受到限制。
      </p>
      <p>
        7.除自行注册“星空”账号外，用户也可授权使用其合法拥有的实名注册的第三方软件用户账号登录使用“星空”及相关服务，但第三方软件或平台对此有限制或禁止的除外。当用户以前述已有账号登录使用的，应保证相应账号已进行实名注册登记，并同样适用本协议中的相关条款。
      </p>
      <p>
        8.当你完成“星空”的账号注册、登录并进行合理和必要的身份验证后，你可随时浏览、修改自己提交的个人身份信息。你理解并同意，出于安全性和身份识别（如账号或密码找回申诉服务等）的考虑，你可能无法修改注册时提供的初始注册信息及其他验证信息。你也可以申请注销账号，博主会在完成个人身份、安全状态、设备信息等合理和必要的验证后协助你注销账号，并依照你的要求删除有关你账号的一切信息，法律法规另有规定的除外。
      </p>
      <p>
        9.您理解并同意，为了充分使用账号资源，如您在注册后未及时进行初次登录使用或连续超过两个月未登录账号使用等情形，博主有权收回您的账号。
      </p>
      <br />
      <h2>二、 用户行为规范</h2>
      <p>
        您应当对您使用“星空”及相关服务的行为负责，除非法律允许或者经博主事先书面许可，您使用“星空”及相关服务不得具有下列行为：
      </p>
      <p>
        （1）非法侵入他人网络、干扰他人网络正常功能、窃取网络数据等危害网络安全的活动；
      </p>
      <p>
        （2）提供专门用于从事侵入网络、干扰网络正常功能及防护措施、窃取网络数据等危害网络安全活动的程序、工具；
      </p>
      <p>
        （3）明知他人从事危害网络安全的活动的，为其提供技术支持、广告推广、支付结算等帮助；
      </p>
      <p>（4）使用未经许可的数据或进入未经许可的服务器/账号；</p>
      <p>
        （5）未经允许进入公众计算机网络或者他人计算机系统并删除、修改、增加存储信息；
      </p>
      <p>
        （6）未经许可，企图探查、扫描、测试“星空”系统或网络的弱点或其它实施破坏网络安全的行为；
      </p>
      <p>
        （7）企图干涉、破坏“星空”系统或网站的正常运行，故意传播恶意程序或病毒以及其他破坏干扰正常网络信息服务的行为；
      </p>
      <p>（8）伪造TCP/IP数据包名称或部分名称；</p>
      <p>
        （9）
        对“星空”及相关服务进行反向工程、反向汇编、编译或者以其他方式尝试发现“星空”的源代码；
      </p>
      <p>
        （10） 恶意注册“星空”及相关服务的账号，包括但不限于频繁、批量注册账号；
      </p>
      <p>
        （11）
        违反法律法规、本协议、博主的相关规则及侵犯他人合法权益的其他行为。
      </p>

      <p>
        <strong>谢谢您的理解！</strong>
      </p>
    </div>
  );
};

export default Protocol;
